
$(function () {
    console.log("----------------------sort()-------------------------");
    var a = ["d","M","a","B","b","D","E","S","s","e"];
    console.log(a.sort());
    //Array [ "B", "D", "E", "M", "S", "a", "b", "d", "e", "s" ]
    //总结：
    //默认按字母升序排序，同时，大写字母排在前面，小写字母排在后面
    
    var b = [19,22,1,33,10,99,29,11,11,56,9];
    b.sort(function (a, b) {
        return a>b;
    });
    console.log(b);
    //Array [ 1, 9, 10, 11, 11, 19, 22, 29, 33, 56, … ]

    b.sort(function (a, b) {
        return a<b;
    });
    console.log(b);
    //Array [ 99, 56, 33, 29, 22, 19, 11, 11, 10, 9, … ]

    //总结：
    //在回调函数内，使用大于号进行比较，将会是升序排序
    //在回调函数内，使用小于号进行比较，将会是降序排序
    
});
