
$(function () {
    console.log("----------------------splice()-------------------------");
    //案例一：在数组内选择部分元素，替换为新元素
    var a = [0,1,2,3,4,5,6,7,8,9];
    console.log(a.splice(0,2,"a","b"));//Array [ 0, 1 ]  返回了被替换的元素组成的数组
    console.log(a);//Array [ "a", "b", 2, 3, 4, 5, 6, 7, 8, 9 ]
    //总结：
    //splice()方法返回被替换的元素，组成的新的数组进行返回
    //splice()方法会改变原数组，将替换的元素永远的替换在了原数组中
    
    //案例二：在数组末尾添加元素
    console.log(a.splice(a.length,0,"c","d"));//Array [] 由于没有元素被替换，所以返回空数组
    console.log(a);//Array [ "a", "b", 2, 3, 4, 5, 6, 7, 8, 9, "c","d"]
    //总结：
    //splice()在末尾添加元素，不会替换任何元素返回空数组
});
